import numpy as np

# CSVは「,」でデータを区切っている

# arr1 = np.loadtxt("testdata.csv", delimiter=",")
"""
左上の最初が空白だとエラーになるので、skiprowsを渡す必要がある

例外が発生しました: ValueError
could not convert string to float: ''
"""

arr1 = np.loadtxt("testdata.csv", delimiter=",", skiprows=1)

# print(arr1)
"""
[[ 0.00000000e+00  0.00000000e+00  0.00000000e+00 ...  0.00000000e+00
   0.00000000e+00  0.00000000e+00]
 [ 1.00000000e+00  2.66089704e+00  3.08680751e-01 ... -1.24374269e+00
   5.18966400e-01 -1.19367115e+00]
 [ 2.00000000e+00  3.59851470e+00  1.08084394e-01 ...  7.50444067e-01
   1.61610718e+00 -1.55848791e+00]
 ...
 [ 4.98000000e+02 -1.13628276e+01 -6.02762346e+00 ...  1.06451172e+01
   4.51958909e+01 -1.51173229e+01]
 [ 4.99000000e+02 -1.06156906e+01 -4.98423594e+00 ...  1.12467625e+01
   4.48587528e+01 -1.55841110e+01]
 [ 5.00000000e+02 -1.10646530e+01 -3.83636751e+00 ...  1.30337334e+01
   4.55136299e+01 -1.32733199e+01]]
"""

# print(arr1.shape)
"""
(501, 101)
"""

np.savetxt("./test.csv", arr1, delimiter=",")

print()